package lessons.lesson12.homeworks
fun main(){
    ex1(listOf(1,5,6))
    ex1(listOf(1,4,6,1,2,1))
    ex2(listOf())
    ex2(listOf(1,2))
    ex3(listOf())
    ex3(listOf(1,2))
    ex4(listOf(1, 2, 42))
    ex4(listOf(1, 2))
    ex5(setOf("m","e","w"))
    ex6(listOf(1,2,3,4,5,6,7,8,9))
    ex7(listOf(1,2,3,4,5,6,7,8,9))
    ex8(arrayOf(1,2,42,3,4,5,6,7,8,9))
    ex9(arrayOf(1,2,3,-10,4,5,6,7,8,9))
    ex10(listOf(42,2,3,4,5,6,7,8,9))
    ex10(listOf())
    ex11(listOf(42,2,3,4), 42)
    ex11(listOf(42,2,3,4), "a")
    ex12(listOf(42,2,23,4,22,6,7,19,9))
    ex13(listOf(42,5,2,22,6,18))
    ex14(listOf("Some", "nulls", null, "here"))
    ex15(listOf("Count", "this", "string"))
    ex16(listOf("Flip", "this", "string"))
    ex17(listOf("C", "B", "A"))
    ex18(listOf("Print","this","text","not","this"))
    ex19(listOf(1,2,3,4))
    ex20(listOf("Group","this","text","by","letter"))
    ex21(listOf(1,2,3,3,1,4,1))
    ex22(listOf(1,2,3,4,5,6,7,8,9))
    ex23(listOf("not","this", "Print","this","text"))
    ex24(listOf())
    ex24(listOf(1,2))
    ex24(listOf(0,1,6,7,8,9))
    ex24(listOf(100000, 400000, 1, 4,5,6,7))
    ex24(listOf(5,10,15,5,10,15))
    ex24(listOf(55, -666, -66, 66, 7))
    ex24(listOf(-111, -110, -17, -11, -15))
    ex24(listOf(1001,1002, 1003, 1004, 1005))
    ex24(listOf(8,15,14,3,6,7))
    ex24(listOf(556, -666, -666, 66, 7777, 777))
    ex25(listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12))
    println(ex26(listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")))
    println(ex27(listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")))
    println(ex28(listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)))
    println(ex29(listOf(22, 18, 30, 45, 17, null, 60), 2))
    println(ex29(listOf(22, 18, 30, 45, 17, null, 60), 70))
}

//Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод, не повторяйся. Список методов в рекомендациях под заданиями.
//Задачи на приведение коллекции к значению
//Проверить, что размер коллекции больше 5 элементов.
fun ex1(list: List<Any>){
    println(list.size > 5)
}
//Проверить, что коллекция пустая
fun ex2(list: List<Any>){
    if(list.isEmpty()){
        println("empty")

    } else {
        println("not empty")
    }
}
//Проверить, что коллекция не пустая
fun ex3(list: List<Any>){
    if(list.isNotEmpty()){
        println("not empty")

    } else {
        println("empty")
    }
}
//Взять элемент по индексу или создать значение если индекса не существует
fun ex4(list: List<Any>){
    println(list.getOrElse(2){404})
}
//Собрать коллекцию в строку
fun ex5(set: Set<Any>){
    println(set.joinToString("^_^"))
}
//Посчитать сумму всех значений
fun ex6(list: List<Int>){
    println(list.sum())
}
//Посчитать среднее
fun ex7(list: List<Int>){
    println(list.average())
}
//Взять максимальное число
fun ex8(array: Array<Int>){
    println(array.maxOrNull())
}
//Взять минимальное число
fun ex9(array: Array<Int>){
    println(array.minOrNull())
}
//Взять первое число или null
fun ex10(list: List<Int>){
    println(list.firstOrNull())
}
//Проверить что коллекция содержит элемент
fun ex11(list: List<Any>, find: Any){
    println(find in list)
}
//Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод, не повторяйся. Список методов в рекомендациях под заданиями.
//Задачи на обработку коллекций
//Отфильтровать коллекцию по диапазону 18-30
fun ex12(list: List<Int>){
    val newList = list.filter { it in 18 .. 30 }
    println(newList)
}
//Выбрать числа, которые не делятся на 2 и 3 одновременно
fun ex13(list: List<Int>){
    val newList = list.filterNot { it%6 == 0}
    println(newList)
}
//Очистить текстовую коллекцию от null элементов
fun ex14(list: List<String?>){
    println(list.filterNotNull())
}
//Преобразовать текстовую коллекцию в коллекцию длин слов
fun ex15(list: List<String>){
    println(list.map { it.length })
}
//Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
fun ex16(list: List<String>){
    println(list.associate { it.reversed() to it.length })
}
//Отсортировать список в алфавитном порядке
fun ex17(list: List<String>){
    println(list.sorted())
}
//Взять первые 3 элемента списка
fun ex18(list: List<String>){
    println(list.take(3))
}
//Распечатать квадраты элементов списка
fun ex19(list: List<Int>){
    println(list.map { it*it })
}
//Группировать список по первой букве слов
fun ex20(list: List<String>){
    println(list.groupBy { it[0] })
}
//Очистить список от дублей
fun ex21(list: List<Int>){
    println(list.distinct())
}
//Отсортировать список по убыванию
fun ex22(list: List<Int>) {
    println(list.sortedDescending())
}

//Взять последние 3 элемента списка
fun ex23(list: List<Any>){
    println(list.takeLast(3))
}
//Реши задачи ниже в отдельных функциях.
//
//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток
fun ex24(list: List<Int>){
    when {
        list.isEmpty() -> println("Пусто")
        list.size < 5 -> println("Короткая")
        list.first() == 0 -> println("Стартовая")
        list.sum() > 10000 -> println("Массивная")
        list.average().toInt() == 10 -> println("Сбалансированная")
        list.joinToString().length == 20 -> println("Клейкая")
        list.max() < -10 -> println("Отрицательная")
        list.min() > 1000 -> println("Положительная")
        list.containsAll(listOf(3, 14)) -> println("Пи***тая")

    else -> println("Уникальная")}
    }

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
//Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
fun ex25(grades: List<Int>){
    val goodGrades = mutableListOf<Int>()
    grades.forEach {
        val goodGrade = it >= 60
        if (goodGrade){
            goodGrades.add(it)
        }
    }
    println(goodGrades.sorted().take(3))
}

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//Начальные значения: val list = listOf(
//"Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
//)
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
fun ex26(list: List<String>): Map<Char, List<String>>{
    val lowList = list.map { it.lowercase() }
    return lowList.groupBy { it[0] }
}
//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
fun ex27(list: List<String>): String {
    val result = list.map {it.length}.average()
    return ("Average: %.2f".format(result))
}
//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
fun ex28(numbers: List<Int>): Map<String, List<Int>>{
    val result = numbers.distinct().sortedDescending().groupBy { if (it%2 == 0) "четные" else "нечетные" }
    return result
}
//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.
fun ex29(ages: List<Int?>, n: Int): Int?{
    return ages.filterNotNull().firstOrNull{it > n}
}