package lessons.lesson14.homeworks

//Мероприятие: концерт. Создайте класс, который будет представлять концерт. У него должны быть свойства “группа”,
// “место проведения”, “стоимость”, “вместимость зала”. Также приватное поле “проданные билеты”.
// Добавьте метод, который выводит информацию о концерте и метод “купить билет”, который увеличивает количество проданных билетов на один.
class Concert(
    val group: String,
    val place: String,
    val price: Double,
    val capacity: Int,

) {
    private var sold: Int = 0
    fun info(){
        println("Концерт группы $group будет проводиться в $place , стоимость билета $price, вместимость зала $capacity человек.")
    }
    fun buyTicket(){
            sold += 1
        }
    }
